Процедура ВыполнитьАутентификацию(Логин) Экспорт
	Соединение= Новый HTTPСоединение("192.168.0.42",,"MobileClient");
	Запрос= Новый HTTPЗапрос("salon/hs/users/getusers?username="+Логин);
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния = 200 Тогда
		ДанныеПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		Если ДанныеПользователя.user = Ложь Тогда
			Сообщить("По логину " + Логин +" пользователь не найден!");
		ИначеЕсли ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда
			АвторизоватьПользователя(Логин);
		КонецЕсли;
	Иначе
		Сообщить("При попытке аутентификации произошла ошибка!");
	КонецЕсли;
	
КонецПроцедуры

Процедура АвторизоватьПользователя(Логин) Экспорт
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = Логин;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
	НовыйПользовательИБ.Записать();
	
	ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(Логин);
	Если ТекущийПользователь.Пустая() Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
		НовыйПользователь.Наименование = Логин;
		НовыйПользователь.Записать(); 
		ТекущийПользователь = НовыйПользователь.Ссылка; 
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
	
КонецПроцедуры

Процедура Разлогиниться() Экспорт
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
		ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();
	КонецЕсли;
	
КонецПроцедуры